/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const ENETUNREACH: u32 = 101;
pub const ENETRESET: u32 = 102;
pub const ECONNABORTED: u32 = 103;
pub const ECONNRESET: u32 = 104;
pub const ENOBUFS: u32 = 105;
pub const EISCONN: u32 = 106;
pub const ENOTCONN: u32 = 107;
pub const ESHUTDOWN: u32 = 108;
pub const ETOOMANYREFS: u32 = 109;
pub const ETIMEDOUT: u32 = 110;
pub const ECONNREFUSED: u32 = 111;
pub const EHOSTDOWN: u32 = 112;
pub const EHOSTUNREACH: u32 = 113;
pub const EALREADY: u32 = 114;
pub const EINPROGRESS: u32 = 115;
pub const ESTALE: u32 = 116;
pub const EUCLEAN: u32 = 117;
pub const ENOTNAM: u32 = 118;
pub const ENAVAIL: u32 = 119;
pub const EISNAM: u32 = 120;
pub const EREMOTEIO: u32 = 121;
pub const EDQUOT: u32 = 122;
pub const ENOMEDIUM: u32 = 123;
pub const EMEDIUMTYPE: u32 = 124;
pub const ECANCELED: u32 = 125;
pub const ENOKEY: u32 = 126;
pub const EKEYEXPIRED: u32 = 127;
pub const EKEYREVOKED: u32 = 128;
pub const EKEYREJECTED: u32 = 129;
pub const EOWNERDEAD: u32 = 130;
pub const ENOTRECOVERABLE: u32 = 131;
pub const ERFKILL: u32 = 132;
pub const EHWPOISON: u32 = 133;
pub const ENOTSUP: u32 = 95;
pub const INVALID_SOCKET: i32 = -1;
pub const PATH_SEP: &[u8; 2] = b"/\0";
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub const _ISupper: _bindgen_ty_1 = 256;
pub const _ISlower: _bindgen_ty_1 = 512;
pub const _ISalpha: _bindgen_ty_1 = 1024;
pub const _ISdigit: _bindgen_ty_1 = 2048;
pub const _ISxdigit: _bindgen_ty_1 = 4096;
pub const _ISspace: _bindgen_ty_1 = 8192;
pub const _ISprint: _bindgen_ty_1 = 16384;
pub const _ISgraph: _bindgen_ty_1 = 32768;
pub const _ISblank: _bindgen_ty_1 = 1;
pub const _IScntrl: _bindgen_ty_1 = 2;
pub const _ISpunct: _bindgen_ty_1 = 4;
pub const _ISalnum: _bindgen_ty_1 = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct flock {
    pub l_type: ::std::os::raw::c_short,
    pub l_whence: ::std::os::raw::c_short,
    pub l_start: __off_t,
    pub l_len: __off_t,
    pub l_pid: __pid_t,
}
#[test]
fn bindgen_test_layout_flock() {
    const UNINIT: ::std::mem::MaybeUninit<flock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<flock>(),
        32usize,
        concat!("Size of: ", stringify!(flock))
    );
    assert_eq!(
        ::std::mem::align_of::<flock>(),
        8usize,
        concat!("Alignment of ", stringify!(flock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_pid)
        )
    );
}
pub type mode_t = __mode_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub const FP_NAN: _bindgen_ty_2 = 0;
pub const FP_INFINITE: _bindgen_ty_2 = 1;
pub const FP_ZERO: _bindgen_ty_2 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_2 = 3;
pub const FP_NORMAL: _bindgen_ty_2 = 4;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
pub type useconds_t = __useconds_t;
pub type socklen_t = __socklen_t;
extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
pub const _PC_LINK_MAX: _bindgen_ty_3 = 0;
pub const _PC_MAX_CANON: _bindgen_ty_3 = 1;
pub const _PC_MAX_INPUT: _bindgen_ty_3 = 2;
pub const _PC_NAME_MAX: _bindgen_ty_3 = 3;
pub const _PC_PATH_MAX: _bindgen_ty_3 = 4;
pub const _PC_PIPE_BUF: _bindgen_ty_3 = 5;
pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_3 = 6;
pub const _PC_NO_TRUNC: _bindgen_ty_3 = 7;
pub const _PC_VDISABLE: _bindgen_ty_3 = 8;
pub const _PC_SYNC_IO: _bindgen_ty_3 = 9;
pub const _PC_ASYNC_IO: _bindgen_ty_3 = 10;
pub const _PC_PRIO_IO: _bindgen_ty_3 = 11;
pub const _PC_SOCK_MAXBUF: _bindgen_ty_3 = 12;
pub const _PC_FILESIZEBITS: _bindgen_ty_3 = 13;
pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_3 = 14;
pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_3 = 15;
pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_3 = 16;
pub const _PC_REC_XFER_ALIGN: _bindgen_ty_3 = 17;
pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_3 = 18;
pub const _PC_SYMLINK_MAX: _bindgen_ty_3 = 19;
pub const _PC_2_SYMLINKS: _bindgen_ty_3 = 20;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const _SC_ARG_MAX: _bindgen_ty_4 = 0;
pub const _SC_CHILD_MAX: _bindgen_ty_4 = 1;
pub const _SC_CLK_TCK: _bindgen_ty_4 = 2;
pub const _SC_NGROUPS_MAX: _bindgen_ty_4 = 3;
pub const _SC_OPEN_MAX: _bindgen_ty_4 = 4;
pub const _SC_STREAM_MAX: _bindgen_ty_4 = 5;
pub const _SC_TZNAME_MAX: _bindgen_ty_4 = 6;
pub const _SC_JOB_CONTROL: _bindgen_ty_4 = 7;
pub const _SC_SAVED_IDS: _bindgen_ty_4 = 8;
pub const _SC_REALTIME_SIGNALS: _bindgen_ty_4 = 9;
pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_4 = 10;
pub const _SC_TIMERS: _bindgen_ty_4 = 11;
pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_4 = 12;
pub const _SC_PRIORITIZED_IO: _bindgen_ty_4 = 13;
pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_4 = 14;
pub const _SC_FSYNC: _bindgen_ty_4 = 15;
pub const _SC_MAPPED_FILES: _bindgen_ty_4 = 16;
pub const _SC_MEMLOCK: _bindgen_ty_4 = 17;
pub const _SC_MEMLOCK_RANGE: _bindgen_ty_4 = 18;
pub const _SC_MEMORY_PROTECTION: _bindgen_ty_4 = 19;
pub const _SC_MESSAGE_PASSING: _bindgen_ty_4 = 20;
pub const _SC_SEMAPHORES: _bindgen_ty_4 = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_4 = 22;
pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_4 = 23;
pub const _SC_AIO_MAX: _bindgen_ty_4 = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_4 = 25;
pub const _SC_DELAYTIMER_MAX: _bindgen_ty_4 = 26;
pub const _SC_MQ_OPEN_MAX: _bindgen_ty_4 = 27;
pub const _SC_MQ_PRIO_MAX: _bindgen_ty_4 = 28;
pub const _SC_VERSION: _bindgen_ty_4 = 29;
pub const _SC_PAGESIZE: _bindgen_ty_4 = 30;
pub const _SC_RTSIG_MAX: _bindgen_ty_4 = 31;
pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_4 = 32;
pub const _SC_SEM_VALUE_MAX: _bindgen_ty_4 = 33;
pub const _SC_SIGQUEUE_MAX: _bindgen_ty_4 = 34;
pub const _SC_TIMER_MAX: _bindgen_ty_4 = 35;
pub const _SC_BC_BASE_MAX: _bindgen_ty_4 = 36;
pub const _SC_BC_DIM_MAX: _bindgen_ty_4 = 37;
pub const _SC_BC_SCALE_MAX: _bindgen_ty_4 = 38;
pub const _SC_BC_STRING_MAX: _bindgen_ty_4 = 39;
pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_4 = 40;
pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_4 = 41;
pub const _SC_EXPR_NEST_MAX: _bindgen_ty_4 = 42;
pub const _SC_LINE_MAX: _bindgen_ty_4 = 43;
pub const _SC_RE_DUP_MAX: _bindgen_ty_4 = 44;
pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_4 = 45;
pub const _SC_2_VERSION: _bindgen_ty_4 = 46;
pub const _SC_2_C_BIND: _bindgen_ty_4 = 47;
pub const _SC_2_C_DEV: _bindgen_ty_4 = 48;
pub const _SC_2_FORT_DEV: _bindgen_ty_4 = 49;
pub const _SC_2_FORT_RUN: _bindgen_ty_4 = 50;
pub const _SC_2_SW_DEV: _bindgen_ty_4 = 51;
pub const _SC_2_LOCALEDEF: _bindgen_ty_4 = 52;
pub const _SC_PII: _bindgen_ty_4 = 53;
pub const _SC_PII_XTI: _bindgen_ty_4 = 54;
pub const _SC_PII_SOCKET: _bindgen_ty_4 = 55;
pub const _SC_PII_INTERNET: _bindgen_ty_4 = 56;
pub const _SC_PII_OSI: _bindgen_ty_4 = 57;
pub const _SC_POLL: _bindgen_ty_4 = 58;
pub const _SC_SELECT: _bindgen_ty_4 = 59;
pub const _SC_UIO_MAXIOV: _bindgen_ty_4 = 60;
pub const _SC_IOV_MAX: _bindgen_ty_4 = 60;
pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_4 = 61;
pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_4 = 62;
pub const _SC_PII_OSI_COTS: _bindgen_ty_4 = 63;
pub const _SC_PII_OSI_CLTS: _bindgen_ty_4 = 64;
pub const _SC_PII_OSI_M: _bindgen_ty_4 = 65;
pub const _SC_T_IOV_MAX: _bindgen_ty_4 = 66;
pub const _SC_THREADS: _bindgen_ty_4 = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_4 = 68;
pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_4 = 69;
pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_4 = 70;
pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_4 = 71;
pub const _SC_TTY_NAME_MAX: _bindgen_ty_4 = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_4 = 73;
pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_4 = 74;
pub const _SC_THREAD_STACK_MIN: _bindgen_ty_4 = 75;
pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_4 = 76;
pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_4 = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_4 = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_4 = 79;
pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_4 = 80;
pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_4 = 81;
pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_4 = 82;
pub const _SC_NPROCESSORS_CONF: _bindgen_ty_4 = 83;
pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_4 = 84;
pub const _SC_PHYS_PAGES: _bindgen_ty_4 = 85;
pub const _SC_AVPHYS_PAGES: _bindgen_ty_4 = 86;
pub const _SC_ATEXIT_MAX: _bindgen_ty_4 = 87;
pub const _SC_PASS_MAX: _bindgen_ty_4 = 88;
pub const _SC_XOPEN_VERSION: _bindgen_ty_4 = 89;
pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_4 = 90;
pub const _SC_XOPEN_UNIX: _bindgen_ty_4 = 91;
pub const _SC_XOPEN_CRYPT: _bindgen_ty_4 = 92;
pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_4 = 93;
pub const _SC_XOPEN_SHM: _bindgen_ty_4 = 94;
pub const _SC_2_CHAR_TERM: _bindgen_ty_4 = 95;
pub const _SC_2_C_VERSION: _bindgen_ty_4 = 96;
pub const _SC_2_UPE: _bindgen_ty_4 = 97;
pub const _SC_XOPEN_XPG2: _bindgen_ty_4 = 98;
pub const _SC_XOPEN_XPG3: _bindgen_ty_4 = 99;
pub const _SC_XOPEN_XPG4: _bindgen_ty_4 = 100;
pub const _SC_CHAR_BIT: _bindgen_ty_4 = 101;
pub const _SC_CHAR_MAX: _bindgen_ty_4 = 102;
pub const _SC_CHAR_MIN: _bindgen_ty_4 = 103;
pub const _SC_INT_MAX: _bindgen_ty_4 = 104;
pub const _SC_INT_MIN: _bindgen_ty_4 = 105;
pub const _SC_LONG_BIT: _bindgen_ty_4 = 106;
pub const _SC_WORD_BIT: _bindgen_ty_4 = 107;
pub const _SC_MB_LEN_MAX: _bindgen_ty_4 = 108;
pub const _SC_NZERO: _bindgen_ty_4 = 109;
pub const _SC_SSIZE_MAX: _bindgen_ty_4 = 110;
pub const _SC_SCHAR_MAX: _bindgen_ty_4 = 111;
pub const _SC_SCHAR_MIN: _bindgen_ty_4 = 112;
pub const _SC_SHRT_MAX: _bindgen_ty_4 = 113;
pub const _SC_SHRT_MIN: _bindgen_ty_4 = 114;
pub const _SC_UCHAR_MAX: _bindgen_ty_4 = 115;
pub const _SC_UINT_MAX: _bindgen_ty_4 = 116;
pub const _SC_ULONG_MAX: _bindgen_ty_4 = 117;
pub const _SC_USHRT_MAX: _bindgen_ty_4 = 118;
pub const _SC_NL_ARGMAX: _bindgen_ty_4 = 119;
pub const _SC_NL_LANGMAX: _bindgen_ty_4 = 120;
pub const _SC_NL_MSGMAX: _bindgen_ty_4 = 121;
pub const _SC_NL_NMAX: _bindgen_ty_4 = 122;
pub const _SC_NL_SETMAX: _bindgen_ty_4 = 123;
pub const _SC_NL_TEXTMAX: _bindgen_ty_4 = 124;
pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_4 = 125;
pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_4 = 126;
pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_4 = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_4 = 128;
pub const _SC_XOPEN_LEGACY: _bindgen_ty_4 = 129;
pub const _SC_XOPEN_REALTIME: _bindgen_ty_4 = 130;
pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_4 = 131;
pub const _SC_ADVISORY_INFO: _bindgen_ty_4 = 132;
pub const _SC_BARRIERS: _bindgen_ty_4 = 133;
pub const _SC_BASE: _bindgen_ty_4 = 134;
pub const _SC_C_LANG_SUPPORT: _bindgen_ty_4 = 135;
pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_4 = 136;
pub const _SC_CLOCK_SELECTION: _bindgen_ty_4 = 137;
pub const _SC_CPUTIME: _bindgen_ty_4 = 138;
pub const _SC_THREAD_CPUTIME: _bindgen_ty_4 = 139;
pub const _SC_DEVICE_IO: _bindgen_ty_4 = 140;
pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_4 = 141;
pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_4 = 142;
pub const _SC_FD_MGMT: _bindgen_ty_4 = 143;
pub const _SC_FIFO: _bindgen_ty_4 = 144;
pub const _SC_PIPE: _bindgen_ty_4 = 145;
pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_4 = 146;
pub const _SC_FILE_LOCKING: _bindgen_ty_4 = 147;
pub const _SC_FILE_SYSTEM: _bindgen_ty_4 = 148;
pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_4 = 149;
pub const _SC_MULTI_PROCESS: _bindgen_ty_4 = 150;
pub const _SC_SINGLE_PROCESS: _bindgen_ty_4 = 151;
pub const _SC_NETWORKING: _bindgen_ty_4 = 152;
pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_4 = 153;
pub const _SC_SPIN_LOCKS: _bindgen_ty_4 = 154;
pub const _SC_REGEXP: _bindgen_ty_4 = 155;
pub const _SC_REGEX_VERSION: _bindgen_ty_4 = 156;
pub const _SC_SHELL: _bindgen_ty_4 = 157;
pub const _SC_SIGNALS: _bindgen_ty_4 = 158;
pub const _SC_SPAWN: _bindgen_ty_4 = 159;
pub const _SC_SPORADIC_SERVER: _bindgen_ty_4 = 160;
pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_4 = 161;
pub const _SC_SYSTEM_DATABASE: _bindgen_ty_4 = 162;
pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_4 = 163;
pub const _SC_TIMEOUTS: _bindgen_ty_4 = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_4 = 165;
pub const _SC_USER_GROUPS: _bindgen_ty_4 = 166;
pub const _SC_USER_GROUPS_R: _bindgen_ty_4 = 167;
pub const _SC_2_PBS: _bindgen_ty_4 = 168;
pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_4 = 169;
pub const _SC_2_PBS_LOCATE: _bindgen_ty_4 = 170;
pub const _SC_2_PBS_MESSAGE: _bindgen_ty_4 = 171;
pub const _SC_2_PBS_TRACK: _bindgen_ty_4 = 172;
pub const _SC_SYMLOOP_MAX: _bindgen_ty_4 = 173;
pub const _SC_STREAMS: _bindgen_ty_4 = 174;
pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_4 = 175;
pub const _SC_V6_ILP32_OFF32: _bindgen_ty_4 = 176;
pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_4 = 177;
pub const _SC_V6_LP64_OFF64: _bindgen_ty_4 = 178;
pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_4 = 179;
pub const _SC_HOST_NAME_MAX: _bindgen_ty_4 = 180;
pub const _SC_TRACE: _bindgen_ty_4 = 181;
pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_4 = 182;
pub const _SC_TRACE_INHERIT: _bindgen_ty_4 = 183;
pub const _SC_TRACE_LOG: _bindgen_ty_4 = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_4 = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_4 = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_4 = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_4 = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_4 = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_4 = 190;
pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_4 = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_4 = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_4 = 193;
pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_4 = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_4 = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_4 = 196;
pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_4 = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_4 = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_4 = 199;
pub const _SC_IPV6: _bindgen_ty_4 = 235;
pub const _SC_RAW_SOCKETS: _bindgen_ty_4 = 236;
pub const _SC_V7_ILP32_OFF32: _bindgen_ty_4 = 237;
pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_4 = 238;
pub const _SC_V7_LP64_OFF64: _bindgen_ty_4 = 239;
pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_4 = 240;
pub const _SC_SS_REPL_MAX: _bindgen_ty_4 = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_4 = 242;
pub const _SC_TRACE_NAME_MAX: _bindgen_ty_4 = 243;
pub const _SC_TRACE_SYS_MAX: _bindgen_ty_4 = 244;
pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_4 = 245;
pub const _SC_XOPEN_STREAMS: _bindgen_ty_4 = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_4 = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_4 = 248;
pub const _SC_MINSIGSTKSZ: _bindgen_ty_4 = 249;
pub const _SC_SIGSTKSZ: _bindgen_ty_4 = 250;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const _CS_PATH: _bindgen_ty_5 = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_5 = 1;
pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_5 = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_5 = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_5 = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_5 = 5;
pub const _CS_LFS_CFLAGS: _bindgen_ty_5 = 1000;
pub const _CS_LFS_LDFLAGS: _bindgen_ty_5 = 1001;
pub const _CS_LFS_LIBS: _bindgen_ty_5 = 1002;
pub const _CS_LFS_LINTFLAGS: _bindgen_ty_5 = 1003;
pub const _CS_LFS64_CFLAGS: _bindgen_ty_5 = 1004;
pub const _CS_LFS64_LDFLAGS: _bindgen_ty_5 = 1005;
pub const _CS_LFS64_LIBS: _bindgen_ty_5 = 1006;
pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_5 = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_5 = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_5 = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_5 = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_5 = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_5 = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_5 = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_5 = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_5 = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_5 = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_5 = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_5 = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_5 = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_5 = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_5 = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_5 = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_5 = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_5 = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_5 = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_5 = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_5 = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_5 = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_5 = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_5 = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_5 = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_5 = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_5 = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_5 = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_5 = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_5 = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_5 = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_5 = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_5 = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_5 = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_5 = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_5 = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_5 = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_5 = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_5 = 1147;
pub const _CS_V6_ENV: _bindgen_ty_5 = 1148;
pub const _CS_V7_ENV: _bindgen_ty_5 = 1149;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::std::mem::MaybeUninit<itimerval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type __itimer_which_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableList {
    _unused: [u8; 0],
}
pub type HashFunction = ::std::option::Option<
    unsafe extern "C" fn(key: *const ::std::os::raw::c_void, len: usize, seed: u32) -> u32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableFunctions {
    pub deinitializer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub hash: HashFunction,
    pub equal: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> bool,
    >,
    pub ref_: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
    >,
    pub deref: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_TableFunctions() {
    const UNINIT: ::std::mem::MaybeUninit<TableFunctions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TableFunctions>(),
        40usize,
        concat!("Size of: ", stringify!(TableFunctions))
    );
    assert_eq!(
        ::std::mem::align_of::<TableFunctions>(),
        8usize,
        concat!("Alignment of ", stringify!(TableFunctions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinitializer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunctions),
            "::",
            stringify!(deinitializer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunctions),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).equal) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunctions),
            "::",
            stringify!(equal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunctions),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deref) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TableFunctions),
            "::",
            stringify!(deref)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Table {
    pub table: *mut TableList,
    pub tableSize: usize,
    pub size: usize,
    pub seed: u32,
    pub fn_: TableFunctions,
}
#[test]
fn bindgen_test_layout_Table() {
    const UNINIT: ::std::mem::MaybeUninit<Table> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Table>(),
        72usize,
        concat!("Size of: ", stringify!(Table))
    );
    assert_eq!(
        ::std::mem::align_of::<Table>(),
        8usize,
        concat!("Alignment of ", stringify!(Table))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).table) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Table),
            "::",
            stringify!(table)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tableSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Table),
            "::",
            stringify!(tableSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Table),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Table),
            "::",
            stringify!(seed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fn_) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Table),
            "::",
            stringify!(fn_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TableIterator {
    pub bucket: usize,
    pub entry: usize,
}
#[test]
fn bindgen_test_layout_TableIterator() {
    const UNINIT: ::std::mem::MaybeUninit<TableIterator> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TableIterator>(),
        16usize,
        concat!("Size of: ", stringify!(TableIterator))
    );
    assert_eq!(
        ::std::mem::align_of::<TableIterator>(),
        8usize,
        concat!("Alignment of ", stringify!(TableIterator))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bucket) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TableIterator),
            "::",
            stringify!(bucket)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TableIterator),
            "::",
            stringify!(entry)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Configuration {
    pub sections: Table,
    pub root: Table,
}
#[test]
fn bindgen_test_layout_Configuration() {
    const UNINIT: ::std::mem::MaybeUninit<Configuration> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Configuration>(),
        144usize,
        concat!("Size of: ", stringify!(Configuration))
    );
    assert_eq!(
        ::std::mem::align_of::<Configuration>(),
        8usize,
        concat!("Alignment of ", stringify!(Configuration))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sections) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Configuration),
            "::",
            stringify!(sections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Configuration),
            "::",
            stringify!(root)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreConfig {
    pub configTable: Configuration,
    pub defaultsTable: Configuration,
    pub overridesTable: Configuration,
    pub port: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_mCoreConfig() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreConfig> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreConfig>(),
        440usize,
        concat!("Size of: ", stringify!(mCoreConfig))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreConfig>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreConfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).configTable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreConfig),
            "::",
            stringify!(configTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultsTable) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreConfig),
            "::",
            stringify!(defaultsTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overridesTable) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreConfig),
            "::",
            stringify!(overridesTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreConfig),
            "::",
            stringify!(port)
        )
    );
}
pub const mCoreConfigLevel_mCONFIG_LEVEL_DEFAULT: mCoreConfigLevel = 0;
pub const mCoreConfigLevel_mCONFIG_LEVEL_CUSTOM: mCoreConfigLevel = 1;
pub const mCoreConfigLevel_mCONFIG_LEVEL_OVERRIDE: mCoreConfigLevel = 2;
pub type mCoreConfigLevel = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreOptions {
    pub bios: *mut ::std::os::raw::c_char,
    pub skipBios: bool,
    pub useBios: bool,
    pub logLevel: ::std::os::raw::c_int,
    pub frameskip: ::std::os::raw::c_int,
    pub rewindEnable: bool,
    pub rewindBufferCapacity: ::std::os::raw::c_int,
    pub rewindBufferInterval: ::std::os::raw::c_int,
    pub fpsTarget: f32,
    pub audioBuffers: usize,
    pub sampleRate: ::std::os::raw::c_uint,
    pub fullscreen: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub lockAspectRatio: bool,
    pub lockIntegerScaling: bool,
    pub interframeBlending: bool,
    pub resampleVideo: bool,
    pub suspendScreensaver: bool,
    pub shader: *mut ::std::os::raw::c_char,
    pub savegamePath: *mut ::std::os::raw::c_char,
    pub savestatePath: *mut ::std::os::raw::c_char,
    pub screenshotPath: *mut ::std::os::raw::c_char,
    pub patchPath: *mut ::std::os::raw::c_char,
    pub cheatsPath: *mut ::std::os::raw::c_char,
    pub volume: ::std::os::raw::c_int,
    pub mute: bool,
    pub videoSync: bool,
    pub audioSync: bool,
}
#[test]
fn bindgen_test_layout_mCoreOptions() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreOptions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreOptions>(),
        128usize,
        concat!("Size of: ", stringify!(mCoreOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bios) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(bios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skipBios) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(skipBios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).useBios) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(useBios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logLevel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(logLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameskip) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(frameskip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rewindEnable) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(rewindEnable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rewindBufferCapacity) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(rewindBufferCapacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rewindBufferInterval) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(rewindBufferInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fpsTarget) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(fpsTarget)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).audioBuffers) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(audioBuffers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleRate) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(sampleRate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fullscreen) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(fullscreen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lockAspectRatio) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(lockAspectRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lockIntegerScaling) as usize - ptr as usize },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(lockIntegerScaling)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interframeBlending) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(interframeBlending)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resampleVideo) as usize - ptr as usize },
        67usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(resampleVideo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suspendScreensaver) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(suspendScreensaver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shader) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(shader)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savegamePath) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(savegamePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savestatePath) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(savestatePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).screenshotPath) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(screenshotPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patchPath) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(patchPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cheatsPath) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(cheatsPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volume) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mute) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(mute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoSync) as usize - ptr as usize },
        125usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(videoSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).audioSync) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreOptions),
            "::",
            stringify!(audioSync)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDirectorySet {
    pub baseName: [::std::os::raw::c_char; 4096usize],
    pub base: *mut VDir,
    pub archive: *mut VDir,
    pub save: *mut VDir,
    pub patch: *mut VDir,
    pub state: *mut VDir,
    pub screenshot: *mut VDir,
    pub cheats: *mut VDir,
}
#[test]
fn bindgen_test_layout_mDirectorySet() {
    const UNINIT: ::std::mem::MaybeUninit<mDirectorySet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDirectorySet>(),
        4152usize,
        concat!("Size of: ", stringify!(mDirectorySet))
    );
    assert_eq!(
        ::std::mem::align_of::<mDirectorySet>(),
        8usize,
        concat!("Alignment of ", stringify!(mDirectorySet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(baseName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        4096usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).archive) as usize - ptr as usize },
        4104usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(archive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save) as usize - ptr as usize },
        4112usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(save)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patch) as usize - ptr as usize },
        4120usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        4128usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).screenshot) as usize - ptr as usize },
        4136usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(screenshot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cheats) as usize - ptr as usize },
        4144usize,
        concat!(
            "Offset of field: ",
            stringify!(mDirectorySet),
            "::",
            stringify!(cheats)
        )
    );
}
pub const mInputHat_M_INPUT_HAT_NEUTRAL: mInputHat = 0;
pub const mInputHat_M_INPUT_HAT_UP: mInputHat = 1;
pub const mInputHat_M_INPUT_HAT_RIGHT: mInputHat = 2;
pub const mInputHat_M_INPUT_HAT_DOWN: mInputHat = 4;
pub const mInputHat_M_INPUT_HAT_LEFT: mInputHat = 8;
pub type mInputHat = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mInputHatBindings {
    pub up: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
    pub down: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_mInputHatBindings() {
    const UNINIT: ::std::mem::MaybeUninit<mInputHatBindings> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mInputHatBindings>(),
        16usize,
        concat!("Size of: ", stringify!(mInputHatBindings))
    );
    assert_eq!(
        ::std::mem::align_of::<mInputHatBindings>(),
        4usize,
        concat!("Alignment of ", stringify!(mInputHatBindings))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).up) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputHatBindings),
            "::",
            stringify!(up)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputHatBindings),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).down) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputHatBindings),
            "::",
            stringify!(down)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputHatBindings),
            "::",
            stringify!(left)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mInputPlatformInfo {
    pub platformName: *const ::std::os::raw::c_char,
    pub keyId: *mut *const ::std::os::raw::c_char,
    pub nKeys: usize,
    pub hat: mInputHatBindings,
}
#[test]
fn bindgen_test_layout_mInputPlatformInfo() {
    const UNINIT: ::std::mem::MaybeUninit<mInputPlatformInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mInputPlatformInfo>(),
        40usize,
        concat!("Size of: ", stringify!(mInputPlatformInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<mInputPlatformInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(mInputPlatformInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).platformName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputPlatformInfo),
            "::",
            stringify!(platformName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputPlatformInfo),
            "::",
            stringify!(keyId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nKeys) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputPlatformInfo),
            "::",
            stringify!(nKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hat) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputPlatformInfo),
            "::",
            stringify!(hat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mInputMap {
    pub maps: *mut mInputMapImpl,
    pub numMaps: usize,
    pub info: *const mInputPlatformInfo,
}
#[test]
fn bindgen_test_layout_mInputMap() {
    const UNINIT: ::std::mem::MaybeUninit<mInputMap> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mInputMap>(),
        24usize,
        concat!("Size of: ", stringify!(mInputMap))
    );
    assert_eq!(
        ::std::mem::align_of::<mInputMap>(),
        8usize,
        concat!("Alignment of ", stringify!(mInputMap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maps) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputMap),
            "::",
            stringify!(maps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numMaps) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputMap),
            "::",
            stringify!(numMaps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputMap),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mInputAxis {
    pub highDirection: ::std::os::raw::c_int,
    pub lowDirection: ::std::os::raw::c_int,
    pub deadHigh: i32,
    pub deadLow: i32,
}
#[test]
fn bindgen_test_layout_mInputAxis() {
    const UNINIT: ::std::mem::MaybeUninit<mInputAxis> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mInputAxis>(),
        16usize,
        concat!("Size of: ", stringify!(mInputAxis))
    );
    assert_eq!(
        ::std::mem::align_of::<mInputAxis>(),
        4usize,
        concat!("Alignment of ", stringify!(mInputAxis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).highDirection) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputAxis),
            "::",
            stringify!(highDirection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lowDirection) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputAxis),
            "::",
            stringify!(lowDirection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deadHigh) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputAxis),
            "::",
            stringify!(deadHigh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deadLow) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mInputAxis),
            "::",
            stringify!(deadLow)
        )
    );
}
pub type color_t = u32;
pub const mColorFormat_mCOLOR_XBGR8: mColorFormat = 1;
pub const mColorFormat_mCOLOR_XRGB8: mColorFormat = 2;
pub const mColorFormat_mCOLOR_BGRX8: mColorFormat = 4;
pub const mColorFormat_mCOLOR_RGBX8: mColorFormat = 8;
pub const mColorFormat_mCOLOR_ABGR8: mColorFormat = 16;
pub const mColorFormat_mCOLOR_ARGB8: mColorFormat = 32;
pub const mColorFormat_mCOLOR_BGRA8: mColorFormat = 64;
pub const mColorFormat_mCOLOR_RGBA8: mColorFormat = 128;
pub const mColorFormat_mCOLOR_RGB5: mColorFormat = 256;
pub const mColorFormat_mCOLOR_BGR5: mColorFormat = 512;
pub const mColorFormat_mCOLOR_RGB565: mColorFormat = 1024;
pub const mColorFormat_mCOLOR_BGR565: mColorFormat = 2048;
pub const mColorFormat_mCOLOR_ARGB5: mColorFormat = 4096;
pub const mColorFormat_mCOLOR_ABGR5: mColorFormat = 8192;
pub const mColorFormat_mCOLOR_RGBA5: mColorFormat = 16384;
pub const mColorFormat_mCOLOR_BGRA5: mColorFormat = 32768;
pub const mColorFormat_mCOLOR_RGB8: mColorFormat = 65536;
pub const mColorFormat_mCOLOR_BGR8: mColorFormat = 131072;
pub const mColorFormat_mCOLOR_L8: mColorFormat = 262144;
pub const mColorFormat_mCOLOR_PAL8: mColorFormat = 524288;
pub const mColorFormat_mCOLOR_ANY: mColorFormat = -1;
pub type mColorFormat = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mImage {
    pub data: *mut ::std::os::raw::c_void,
    pub palette: *mut u32,
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub stride: ::std::os::raw::c_uint,
    pub depth: ::std::os::raw::c_uint,
    pub palSize: ::std::os::raw::c_uint,
    pub format: mColorFormat,
}
#[test]
fn bindgen_test_layout_mImage() {
    const UNINIT: ::std::mem::MaybeUninit<mImage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mImage>(),
        40usize,
        concat!("Size of: ", stringify!(mImage))
    );
    assert_eq!(
        ::std::mem::align_of::<mImage>(),
        8usize,
        concat!("Alignment of ", stringify!(mImage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palette) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stride) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(palSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mImage),
            "::",
            stringify!(format)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mPainter {
    pub backing: *mut mImage,
    pub blend: bool,
    pub fill: bool,
    pub strokeWidth: ::std::os::raw::c_uint,
    pub strokeColor: u32,
    pub fillColor: u32,
}
#[test]
fn bindgen_test_layout_mPainter() {
    const UNINIT: ::std::mem::MaybeUninit<mPainter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mPainter>(),
        24usize,
        concat!("Size of: ", stringify!(mPainter))
    );
    assert_eq!(
        ::std::mem::align_of::<mPainter>(),
        8usize,
        concat!("Alignment of ", stringify!(mPainter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backing) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(backing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(blend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fill) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(fill)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strokeWidth) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(strokeWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strokeColor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(strokeColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fillColor) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mPainter),
            "::",
            stringify!(fillColor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IntList {
    pub vector: *mut ::std::os::raw::c_int,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_IntList() {
    const UNINIT: ::std::mem::MaybeUninit<IntList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IntList>(),
        24usize,
        concat!("Size of: ", stringify!(IntList))
    );
    assert_eq!(
        ::std::mem::align_of::<IntList>(),
        8usize,
        concat!("Alignment of ", stringify!(IntList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IntList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IntList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IntList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SInt8List {
    pub vector: *mut i8,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_SInt8List() {
    const UNINIT: ::std::mem::MaybeUninit<SInt8List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SInt8List>(),
        24usize,
        concat!("Size of: ", stringify!(SInt8List))
    );
    assert_eq!(
        ::std::mem::align_of::<SInt8List>(),
        8usize,
        concat!("Alignment of ", stringify!(SInt8List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt8List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt8List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt8List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SInt16List {
    pub vector: *mut i16,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_SInt16List() {
    const UNINIT: ::std::mem::MaybeUninit<SInt16List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SInt16List>(),
        24usize,
        concat!("Size of: ", stringify!(SInt16List))
    );
    assert_eq!(
        ::std::mem::align_of::<SInt16List>(),
        8usize,
        concat!("Alignment of ", stringify!(SInt16List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt16List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt16List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt16List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SInt32List {
    pub vector: *mut i32,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_SInt32List() {
    const UNINIT: ::std::mem::MaybeUninit<SInt32List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SInt32List>(),
        24usize,
        concat!("Size of: ", stringify!(SInt32List))
    );
    assert_eq!(
        ::std::mem::align_of::<SInt32List>(),
        8usize,
        concat!("Alignment of ", stringify!(SInt32List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt32List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt32List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SInt32List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIntPtrList {
    pub vector: *mut isize,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_SIntPtrList() {
    const UNINIT: ::std::mem::MaybeUninit<SIntPtrList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SIntPtrList>(),
        24usize,
        concat!("Size of: ", stringify!(SIntPtrList))
    );
    assert_eq!(
        ::std::mem::align_of::<SIntPtrList>(),
        8usize,
        concat!("Alignment of ", stringify!(SIntPtrList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SIntPtrList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SIntPtrList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SIntPtrList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UInt8List {
    pub vector: *mut u8,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_UInt8List() {
    const UNINIT: ::std::mem::MaybeUninit<UInt8List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UInt8List>(),
        24usize,
        concat!("Size of: ", stringify!(UInt8List))
    );
    assert_eq!(
        ::std::mem::align_of::<UInt8List>(),
        8usize,
        concat!("Alignment of ", stringify!(UInt8List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt8List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt8List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt8List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UInt16List {
    pub vector: *mut u16,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_UInt16List() {
    const UNINIT: ::std::mem::MaybeUninit<UInt16List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UInt16List>(),
        24usize,
        concat!("Size of: ", stringify!(UInt16List))
    );
    assert_eq!(
        ::std::mem::align_of::<UInt16List>(),
        8usize,
        concat!("Alignment of ", stringify!(UInt16List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt16List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt16List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt16List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UInt32List {
    pub vector: *mut u32,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_UInt32List() {
    const UNINIT: ::std::mem::MaybeUninit<UInt32List> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UInt32List>(),
        24usize,
        concat!("Size of: ", stringify!(UInt32List))
    );
    assert_eq!(
        ::std::mem::align_of::<UInt32List>(),
        8usize,
        concat!("Alignment of ", stringify!(UInt32List))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt32List),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt32List),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UInt32List),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UIntPtrList {
    pub vector: *mut usize,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_UIntPtrList() {
    const UNINIT: ::std::mem::MaybeUninit<UIntPtrList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<UIntPtrList>(),
        24usize,
        concat!("Size of: ", stringify!(UIntPtrList))
    );
    assert_eq!(
        ::std::mem::align_of::<UIntPtrList>(),
        8usize,
        concat!("Alignment of ", stringify!(UIntPtrList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UIntPtrList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UIntPtrList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UIntPtrList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StringList {
    pub vector: *mut *mut ::std::os::raw::c_char,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_StringList() {
    const UNINIT: ::std::mem::MaybeUninit<StringList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<StringList>(),
        24usize,
        concat!("Size of: ", stringify!(StringList))
    );
    assert_eq!(
        ::std::mem::align_of::<StringList>(),
        8usize,
        concat!("Alignment of ", stringify!(StringList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StringList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(StringList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(StringList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStateExtdataItem {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blip_t {
    _unused: [u8; 0],
}
pub const mCoreFeature_mCORE_FEATURE_OPENGL: mCoreFeature = 1;
pub type mCoreFeature = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreCallbacks {
    pub context: *mut ::std::os::raw::c_void,
    pub videoFrameStarted:
        ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub videoFrameEnded:
        ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub coreCrashed:
        ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub sleep: ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub shutdown: ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub keysRead: ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub savedataUpdated:
        ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
    pub alarm: ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_mCoreCallbacks() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreCallbacks> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreCallbacks>(),
        72usize,
        concat!("Size of: ", stringify!(mCoreCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreCallbacks))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoFrameStarted) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(videoFrameStarted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoFrameEnded) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(videoFrameEnded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coreCrashed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(coreCrashed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sleep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(sleep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shutdown) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(shutdown)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keysRead) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(keysRead)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savedataUpdated) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(savedataUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alarm) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacks),
            "::",
            stringify!(alarm)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreCallbacksList {
    pub vector: *mut mCoreCallbacks,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_mCoreCallbacksList() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreCallbacksList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreCallbacksList>(),
        24usize,
        concat!("Size of: ", stringify!(mCoreCallbacksList))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreCallbacksList>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreCallbacksList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacksList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacksList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreCallbacksList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mAVStream {
    pub videoDimensionsChanged: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mAVStream,
            width: ::std::os::raw::c_uint,
            height: ::std::os::raw::c_uint,
        ),
    >,
    pub audioRateChanged: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mAVStream, rate: ::std::os::raw::c_uint),
    >,
    pub postVideoFrame: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mAVStream, buffer: *const color_t, stride: usize),
    >,
    pub postAudioFrame:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mAVStream, left: i16, right: i16)>,
    pub postAudioBuffer: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mAVStream, left: *mut blip_t, right: *mut blip_t),
    >,
}
#[test]
fn bindgen_test_layout_mAVStream() {
    const UNINIT: ::std::mem::MaybeUninit<mAVStream> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mAVStream>(),
        40usize,
        concat!("Size of: ", stringify!(mAVStream))
    );
    assert_eq!(
        ::std::mem::align_of::<mAVStream>(),
        8usize,
        concat!("Alignment of ", stringify!(mAVStream))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoDimensionsChanged) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mAVStream),
            "::",
            stringify!(videoDimensionsChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).audioRateChanged) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mAVStream),
            "::",
            stringify!(audioRateChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).postVideoFrame) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mAVStream),
            "::",
            stringify!(postVideoFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).postAudioFrame) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mAVStream),
            "::",
            stringify!(postAudioFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).postAudioBuffer) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mAVStream),
            "::",
            stringify!(postAudioBuffer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStereoSample {
    pub left: i16,
    pub right: i16,
}
#[test]
fn bindgen_test_layout_mStereoSample() {
    const UNINIT: ::std::mem::MaybeUninit<mStereoSample> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mStereoSample>(),
        4usize,
        concat!("Size of: ", stringify!(mStereoSample))
    );
    assert_eq!(
        ::std::mem::align_of::<mStereoSample>(),
        2usize,
        concat!("Alignment of ", stringify!(mStereoSample))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mStereoSample),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(mStereoSample),
            "::",
            stringify!(right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mKeyCallback {
    pub readKeys: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mKeyCallback) -> u16>,
    pub requireOpposingDirections: bool,
}
#[test]
fn bindgen_test_layout_mKeyCallback() {
    const UNINIT: ::std::mem::MaybeUninit<mKeyCallback> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mKeyCallback>(),
        16usize,
        concat!("Size of: ", stringify!(mKeyCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<mKeyCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(mKeyCallback))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readKeys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mKeyCallback),
            "::",
            stringify!(readKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).requireOpposingDirections) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mKeyCallback),
            "::",
            stringify!(requireOpposingDirections)
        )
    );
}
pub const mPeripheral_mPERIPH_ROTATION: mPeripheral = 1;
pub const mPeripheral_mPERIPH_RUMBLE: mPeripheral = 2;
pub const mPeripheral_mPERIPH_IMAGE_SOURCE: mPeripheral = 3;
pub const mPeripheral_mPERIPH_CUSTOM: mPeripheral = 4096;
pub type mPeripheral = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mRotationSource {
    pub sample: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRotationSource)>,
    pub readTiltX: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRotationSource) -> i32>,
    pub readTiltY: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRotationSource) -> i32>,
    pub readGyroZ: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRotationSource) -> i32>,
}
#[test]
fn bindgen_test_layout_mRotationSource() {
    const UNINIT: ::std::mem::MaybeUninit<mRotationSource> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mRotationSource>(),
        32usize,
        concat!("Size of: ", stringify!(mRotationSource))
    );
    assert_eq!(
        ::std::mem::align_of::<mRotationSource>(),
        8usize,
        concat!("Alignment of ", stringify!(mRotationSource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mRotationSource),
            "::",
            stringify!(sample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readTiltX) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mRotationSource),
            "::",
            stringify!(readTiltX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readTiltY) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mRotationSource),
            "::",
            stringify!(readTiltY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readGyroZ) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mRotationSource),
            "::",
            stringify!(readGyroZ)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mRTCSource {
    pub sample: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRTCSource)>,
    pub unixTime: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mRTCSource) -> time_t>,
    pub serialize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mRTCSource, arg2: *mut mStateExtdataItem),
    >,
    pub deserialize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mRTCSource, arg2: *const mStateExtdataItem) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_mRTCSource() {
    const UNINIT: ::std::mem::MaybeUninit<mRTCSource> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mRTCSource>(),
        32usize,
        concat!("Size of: ", stringify!(mRTCSource))
    );
    assert_eq!(
        ::std::mem::align_of::<mRTCSource>(),
        8usize,
        concat!("Alignment of ", stringify!(mRTCSource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCSource),
            "::",
            stringify!(sample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unixTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCSource),
            "::",
            stringify!(unixTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).serialize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCSource),
            "::",
            stringify!(serialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deserialize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCSource),
            "::",
            stringify!(deserialize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mImageSource {
    pub startRequestImage: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mImageSource,
            w: ::std::os::raw::c_uint,
            h: ::std::os::raw::c_uint,
            colorFormats: ::std::os::raw::c_int,
        ),
    >,
    pub stopRequestImage: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mImageSource)>,
    pub requestImage: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mImageSource,
            buffer: *mut *const ::std::os::raw::c_void,
            stride: *mut usize,
            colorFormat: *mut mColorFormat,
        ),
    >,
}
#[test]
fn bindgen_test_layout_mImageSource() {
    const UNINIT: ::std::mem::MaybeUninit<mImageSource> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mImageSource>(),
        24usize,
        concat!("Size of: ", stringify!(mImageSource))
    );
    assert_eq!(
        ::std::mem::align_of::<mImageSource>(),
        8usize,
        concat!("Alignment of ", stringify!(mImageSource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startRequestImage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mImageSource),
            "::",
            stringify!(startRequestImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stopRequestImage) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mImageSource),
            "::",
            stringify!(stopRequestImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).requestImage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mImageSource),
            "::",
            stringify!(requestImage)
        )
    );
}
pub const mRTCGenericType_RTC_NO_OVERRIDE: mRTCGenericType = 0;
pub const mRTCGenericType_RTC_FIXED: mRTCGenericType = 1;
pub const mRTCGenericType_RTC_FAKE_EPOCH: mRTCGenericType = 2;
pub const mRTCGenericType_RTC_WALLCLOCK_OFFSET: mRTCGenericType = 3;
pub const mRTCGenericType_RTC_CUSTOM_START: mRTCGenericType = 4096;
pub type mRTCGenericType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mRTCGenericSource {
    pub d: mRTCSource,
    pub p: *mut mCore,
    pub override_: mRTCGenericType,
    pub value: i64,
    pub custom: *mut mRTCSource,
}
#[test]
fn bindgen_test_layout_mRTCGenericSource() {
    const UNINIT: ::std::mem::MaybeUninit<mRTCGenericSource> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mRTCGenericSource>(),
        64usize,
        concat!("Size of: ", stringify!(mRTCGenericSource))
    );
    assert_eq!(
        ::std::mem::align_of::<mRTCGenericSource>(),
        8usize,
        concat!("Alignment of ", stringify!(mRTCGenericSource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericSource),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericSource),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).override_) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericSource),
            "::",
            stringify!(override_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericSource),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericSource),
            "::",
            stringify!(custom)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mRTCGenericState {
    pub type_: i32,
    pub padding: i32,
    pub value: i64,
}
#[test]
fn bindgen_test_layout_mRTCGenericState() {
    const UNINIT: ::std::mem::MaybeUninit<mRTCGenericState> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mRTCGenericState>(),
        16usize,
        concat!("Size of: ", stringify!(mRTCGenericState))
    );
    assert_eq!(
        ::std::mem::align_of::<mRTCGenericState>(),
        8usize,
        concat!("Alignment of ", stringify!(mRTCGenericState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericState),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericState),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mRTCGenericState),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mRumble {
    pub setRumble: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mRumble, enable: ::std::os::raw::c_int),
    >,
}
#[test]
fn bindgen_test_layout_mRumble() {
    const UNINIT: ::std::mem::MaybeUninit<mRumble> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mRumble>(),
        8usize,
        concat!("Size of: ", stringify!(mRumble))
    );
    assert_eq!(
        ::std::mem::align_of::<mRumble>(),
        8usize,
        concat!("Alignment of ", stringify!(mRumble))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setRumble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mRumble),
            "::",
            stringify!(setRumble)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreChannelInfo {
    pub id: usize,
    pub internalName: *const ::std::os::raw::c_char,
    pub visibleName: *const ::std::os::raw::c_char,
    pub visibleType: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_mCoreChannelInfo() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreChannelInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreChannelInfo>(),
        32usize,
        concat!("Size of: ", stringify!(mCoreChannelInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreChannelInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreChannelInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreChannelInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internalName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreChannelInfo),
            "::",
            stringify!(internalName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).visibleName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreChannelInfo),
            "::",
            stringify!(visibleName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).visibleType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreChannelInfo),
            "::",
            stringify!(visibleType)
        )
    );
}
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_READ: mCoreMemoryBlockFlags = 1;
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_WRITE: mCoreMemoryBlockFlags = 2;
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_RW: mCoreMemoryBlockFlags = 3;
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_WORM: mCoreMemoryBlockFlags = 4;
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_MAPPED: mCoreMemoryBlockFlags = 16;
pub const mCoreMemoryBlockFlags_mCORE_MEMORY_VIRTUAL: mCoreMemoryBlockFlags = 32;
pub type mCoreMemoryBlockFlags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreMemoryBlock {
    pub id: usize,
    pub internalName: *const ::std::os::raw::c_char,
    pub shortName: *const ::std::os::raw::c_char,
    pub longName: *const ::std::os::raw::c_char,
    pub start: u32,
    pub end: u32,
    pub size: u32,
    pub flags: u32,
    pub maxSegment: u16,
    pub segmentStart: u32,
}
#[test]
fn bindgen_test_layout_mCoreMemoryBlock() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreMemoryBlock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreMemoryBlock>(),
        56usize,
        concat!("Size of: ", stringify!(mCoreMemoryBlock))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreMemoryBlock>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreMemoryBlock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internalName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(internalName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(shortName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(longName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSegment) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(maxSegment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segmentStart) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreMemoryBlock),
            "::",
            stringify!(segmentStart)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreScreenRegion {
    pub id: usize,
    pub description: *const ::std::os::raw::c_char,
    pub x: i16,
    pub y: i16,
    pub w: i16,
    pub h: i16,
}
#[test]
fn bindgen_test_layout_mCoreScreenRegion() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreScreenRegion> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreScreenRegion>(),
        24usize,
        concat!("Size of: ", stringify!(mCoreScreenRegion))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreScreenRegion>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreScreenRegion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreScreenRegion),
            "::",
            stringify!(h)
        )
    );
}
pub const mCoreRegisterType_mCORE_REGISTER_GPR: mCoreRegisterType = 0;
pub const mCoreRegisterType_mCORE_REGISTER_FPR: mCoreRegisterType = 1;
pub const mCoreRegisterType_mCORE_REGISTER_FLAGS: mCoreRegisterType = 2;
pub const mCoreRegisterType_mCORE_REGISTER_SIMD: mCoreRegisterType = 3;
pub type mCoreRegisterType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreRegisterInfo {
    pub name: *const ::std::os::raw::c_char,
    pub aliases: *mut *const ::std::os::raw::c_char,
    pub width: ::std::os::raw::c_uint,
    pub mask: u32,
    pub type_: mCoreRegisterType,
}
#[test]
fn bindgen_test_layout_mCoreRegisterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<mCoreRegisterInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCoreRegisterInfo>(),
        32usize,
        concat!("Size of: ", stringify!(mCoreRegisterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<mCoreRegisterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(mCoreRegisterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreRegisterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aliases) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreRegisterInfo),
            "::",
            stringify!(aliases)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreRegisterInfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreRegisterInfo),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCoreRegisterInfo),
            "::",
            stringify!(type_)
        )
    );
}
pub const mPlatform_mPLATFORM_NONE: mPlatform = -1;
pub const mPlatform_mPLATFORM_GBA: mPlatform = 0;
pub const mPlatform_mPLATFORM_GB: mPlatform = 1;
pub type mPlatform = ::std::os::raw::c_int;
pub const mCoreChecksumType_mCHECKSUM_CRC32: mCoreChecksumType = 0;
pub type mCoreChecksumType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCoreSync {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerSymbols {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStateExtdata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mVideoLogContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCore {
    pub cpu: *mut ::std::os::raw::c_void,
    pub board: *mut ::std::os::raw::c_void,
    pub timing: *mut mTiming,
    pub debugger: *mut mDebugger,
    pub symbolTable: *mut mDebuggerSymbols,
    pub videoLogger: *mut mVideoLogger,
    pub dirs: mDirectorySet,
    pub inputMap: mInputMap,
    pub config: mCoreConfig,
    pub opts: mCoreOptions,
    pub rtc: mRTCGenericSource,
    pub init: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore) -> bool>,
    pub deinit: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub platform: ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> mPlatform>,
    pub supportsFeature:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore, arg2: mCoreFeature) -> bool>,
    pub setSync:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, arg2: *mut mCoreSync)>,
    pub loadConfig:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, arg2: *const mCoreConfig)>,
    pub reloadConfigOption: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            option: *const ::std::os::raw::c_char,
            arg2: *const mCoreConfig,
        ),
    >,
    pub setOverride: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, override_: *const ::std::os::raw::c_void),
    >,
    pub baseVideoSize: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const mCore,
            width: *mut ::std::os::raw::c_uint,
            height: *mut ::std::os::raw::c_uint,
        ),
    >,
    pub currentVideoSize: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const mCore,
            width: *mut ::std::os::raw::c_uint,
            height: *mut ::std::os::raw::c_uint,
        ),
    >,
    pub videoScale:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> ::std::os::raw::c_uint>,
    pub screenRegions: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, arg2: *mut *const mCoreScreenRegion) -> usize,
    >,
    pub setVideoBuffer: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, buffer: *mut color_t, stride: usize),
    >,
    pub setVideoGLTex: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, texid: ::std::os::raw::c_uint),
    >,
    pub getPixels: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            buffer: *mut *const ::std::os::raw::c_void,
            stride: *mut usize,
        ),
    >,
    pub putPixels: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            buffer: *const ::std::os::raw::c_void,
            stride: usize,
        ),
    >,
    pub getAudioChannel: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, ch: ::std::os::raw::c_int) -> *mut blip_t,
    >,
    pub setAudioBufferSize:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, samples: usize)>,
    pub getAudioBufferSize: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore) -> usize>,
    pub addCoreCallbacks:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, arg2: *mut mCoreCallbacks)>,
    pub clearCoreCallbacks: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub setAVStream:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, arg2: *mut mAVStream)>,
    pub isROM: ::std::option::Option<unsafe extern "C" fn(vf: *mut VFile) -> bool>,
    pub loadROM:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, vf: *mut VFile) -> bool>,
    pub loadSave:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, vf: *mut VFile) -> bool>,
    pub loadTemporarySave:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, vf: *mut VFile) -> bool>,
    pub unloadROM: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub romSize: ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> usize>,
    pub checksum: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const mCore,
            data: *mut ::std::os::raw::c_void,
            type_: mCoreChecksumType,
        ),
    >,
    pub loadBIOS: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            vf: *mut VFile,
            biosID: ::std::os::raw::c_int,
        ) -> bool,
    >,
    pub selectBIOS: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, biosID: ::std::os::raw::c_int) -> bool,
    >,
    pub loadPatch:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, vf: *mut VFile) -> bool>,
    pub reset: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub runFrame: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub runLoop: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub step: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
    pub stateSize: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore) -> usize>,
    pub loadState: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, state: *const ::std::os::raw::c_void) -> bool,
    >,
    pub saveState: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, state: *mut ::std::os::raw::c_void) -> bool,
    >,
    pub setKeys: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, keys: u32)>,
    pub addKeys: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, keys: u32)>,
    pub clearKeys: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, keys: u32)>,
    pub getKeys: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore) -> u32>,
    pub frameCounter: ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> u32>,
    pub frameCycles: ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> i32>,
    pub frequency: ::std::option::Option<unsafe extern "C" fn(arg1: *const mCore) -> i32>,
    pub getGameTitle: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, title: *mut ::std::os::raw::c_char),
    >,
    pub getGameCode: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, title: *mut ::std::os::raw::c_char),
    >,
    pub setPeripheral: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            type_: ::std::os::raw::c_int,
            arg2: *mut ::std::os::raw::c_void,
        ),
    >,
    pub getPeripheral: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            type_: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub busRead8:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32) -> u32>,
    pub busRead16:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32) -> u32>,
    pub busRead32:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32) -> u32>,
    pub busWrite8:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32, arg2: u8)>,
    pub busWrite16:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32, arg2: u16)>,
    pub busWrite32:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, address: u32, arg2: u32)>,
    pub rawRead8: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, address: u32, segment: ::std::os::raw::c_int) -> u32,
    >,
    pub rawRead16: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, address: u32, segment: ::std::os::raw::c_int) -> u32,
    >,
    pub rawRead32: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, address: u32, segment: ::std::os::raw::c_int) -> u32,
    >,
    pub rawWrite8: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            address: u32,
            segment: ::std::os::raw::c_int,
            arg2: u8,
        ),
    >,
    pub rawWrite16: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            address: u32,
            segment: ::std::os::raw::c_int,
            arg2: u16,
        ),
    >,
    pub rawWrite32: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            address: u32,
            segment: ::std::os::raw::c_int,
            arg2: u32,
        ),
    >,
    pub listMemoryBlocks: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, arg2: *mut *const mCoreMemoryBlock) -> usize,
    >,
    pub getMemoryBlock: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            id: usize,
            sizeOut: *mut usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub listRegisters: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, arg2: *mut *const mCoreRegisterInfo) -> usize,
    >,
    pub readRegister: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const mCore,
            name: *const ::std::os::raw::c_char,
            out: *mut ::std::os::raw::c_void,
        ) -> bool,
    >,
    pub writeRegister: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            name: *const ::std::os::raw::c_char,
            in_: *const ::std::os::raw::c_void,
        ) -> bool,
    >,
    pub cheatDevice:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore) -> *mut mCheatDevice>,
    pub savedataClone: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mCore, sram: *mut *mut ::std::os::raw::c_void) -> usize,
    >,
    pub savedataRestore: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mCore,
            sram: *const ::std::os::raw::c_void,
            size: usize,
            writeback: bool,
        ) -> bool,
    >,
    pub listVideoLayers: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, arg2: *mut *const mCoreChannelInfo) -> usize,
    >,
    pub listAudioChannels: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const mCore, arg2: *mut *const mCoreChannelInfo) -> usize,
    >,
    pub enableVideoLayer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, id: usize, enable: bool)>,
    pub enableAudioChannel:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, id: usize, enable: bool)>,
    pub adjustVideoLayer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, id: usize, x: i32, y: i32)>,
    pub startVideoLog:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore, arg2: *mut mVideoLogContext)>,
    pub endVideoLog: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mCore)>,
}
#[test]
fn bindgen_test_layout_mCore() {
    const UNINIT: ::std::mem::MaybeUninit<mCore> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCore>(),
        5472usize,
        concat!("Size of: ", stringify!(mCore))
    );
    assert_eq!(
        ::std::mem::align_of::<mCore>(),
        8usize,
        concat!("Alignment of ", stringify!(mCore))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpu) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(cpu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).board) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(board)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timing) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(timing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debugger) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(debugger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbolTable) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(symbolTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoLogger) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(videoLogger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dirs) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(dirs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inputMap) as usize - ptr as usize },
        4200usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(inputMap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        4224usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opts) as usize - ptr as usize },
        4664usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(opts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rtc) as usize - ptr as usize },
        4792usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rtc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        4856usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinit) as usize - ptr as usize },
        4864usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(deinit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).platform) as usize - ptr as usize },
        4872usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(platform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supportsFeature) as usize - ptr as usize },
        4880usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(supportsFeature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setSync) as usize - ptr as usize },
        4888usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadConfig) as usize - ptr as usize },
        4896usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadConfig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reloadConfigOption) as usize - ptr as usize },
        4904usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(reloadConfigOption)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setOverride) as usize - ptr as usize },
        4912usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setOverride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseVideoSize) as usize - ptr as usize },
        4920usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(baseVideoSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentVideoSize) as usize - ptr as usize },
        4928usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(currentVideoSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).videoScale) as usize - ptr as usize },
        4936usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(videoScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).screenRegions) as usize - ptr as usize },
        4944usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(screenRegions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setVideoBuffer) as usize - ptr as usize },
        4952usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setVideoBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setVideoGLTex) as usize - ptr as usize },
        4960usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setVideoGLTex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getPixels) as usize - ptr as usize },
        4968usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getPixels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).putPixels) as usize - ptr as usize },
        4976usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(putPixels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAudioChannel) as usize - ptr as usize },
        4984usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getAudioChannel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setAudioBufferSize) as usize - ptr as usize },
        4992usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setAudioBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAudioBufferSize) as usize - ptr as usize },
        5000usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getAudioBufferSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addCoreCallbacks) as usize - ptr as usize },
        5008usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(addCoreCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clearCoreCallbacks) as usize - ptr as usize },
        5016usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(clearCoreCallbacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setAVStream) as usize - ptr as usize },
        5024usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setAVStream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isROM) as usize - ptr as usize },
        5032usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(isROM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadROM) as usize - ptr as usize },
        5040usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadROM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadSave) as usize - ptr as usize },
        5048usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadSave)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadTemporarySave) as usize - ptr as usize },
        5056usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadTemporarySave)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unloadROM) as usize - ptr as usize },
        5064usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(unloadROM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).romSize) as usize - ptr as usize },
        5072usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(romSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        5080usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(checksum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadBIOS) as usize - ptr as usize },
        5088usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadBIOS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).selectBIOS) as usize - ptr as usize },
        5096usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(selectBIOS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadPatch) as usize - ptr as usize },
        5104usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadPatch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        5112usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runFrame) as usize - ptr as usize },
        5120usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(runFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runLoop) as usize - ptr as usize },
        5128usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(runLoop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        5136usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(step)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stateSize) as usize - ptr as usize },
        5144usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(stateSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadState) as usize - ptr as usize },
        5152usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(loadState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).saveState) as usize - ptr as usize },
        5160usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(saveState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setKeys) as usize - ptr as usize },
        5168usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addKeys) as usize - ptr as usize },
        5176usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(addKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clearKeys) as usize - ptr as usize },
        5184usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(clearKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getKeys) as usize - ptr as usize },
        5192usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameCounter) as usize - ptr as usize },
        5200usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(frameCounter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameCycles) as usize - ptr as usize },
        5208usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(frameCycles)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        5216usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(frequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getGameTitle) as usize - ptr as usize },
        5224usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getGameTitle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getGameCode) as usize - ptr as usize },
        5232usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getGameCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setPeripheral) as usize - ptr as usize },
        5240usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(setPeripheral)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getPeripheral) as usize - ptr as usize },
        5248usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getPeripheral)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busRead8) as usize - ptr as usize },
        5256usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busRead8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busRead16) as usize - ptr as usize },
        5264usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busRead16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busRead32) as usize - ptr as usize },
        5272usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busRead32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busWrite8) as usize - ptr as usize },
        5280usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busWrite8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busWrite16) as usize - ptr as usize },
        5288usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busWrite16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).busWrite32) as usize - ptr as usize },
        5296usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(busWrite32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawRead8) as usize - ptr as usize },
        5304usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawRead8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawRead16) as usize - ptr as usize },
        5312usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawRead16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawRead32) as usize - ptr as usize },
        5320usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawRead32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawWrite8) as usize - ptr as usize },
        5328usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawWrite8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawWrite16) as usize - ptr as usize },
        5336usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawWrite16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rawWrite32) as usize - ptr as usize },
        5344usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(rawWrite32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listMemoryBlocks) as usize - ptr as usize },
        5352usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(listMemoryBlocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getMemoryBlock) as usize - ptr as usize },
        5360usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(getMemoryBlock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listRegisters) as usize - ptr as usize },
        5368usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(listRegisters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readRegister) as usize - ptr as usize },
        5376usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(readRegister)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).writeRegister) as usize - ptr as usize },
        5384usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(writeRegister)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cheatDevice) as usize - ptr as usize },
        5392usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(cheatDevice)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savedataClone) as usize - ptr as usize },
        5400usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(savedataClone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savedataRestore) as usize - ptr as usize },
        5408usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(savedataRestore)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listVideoLayers) as usize - ptr as usize },
        5416usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(listVideoLayers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listAudioChannels) as usize - ptr as usize },
        5424usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(listAudioChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enableVideoLayer) as usize - ptr as usize },
        5432usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(enableVideoLayer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enableAudioChannel) as usize - ptr as usize },
        5440usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(enableAudioChannel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adjustVideoLayer) as usize - ptr as usize },
        5448usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(adjustVideoLayer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).startVideoLog) as usize - ptr as usize },
        5456usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(startVideoLog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endVideoLog) as usize - ptr as usize },
        5464usize,
        concat!(
            "Offset of field: ",
            stringify!(mCore),
            "::",
            stringify!(endVideoLog)
        )
    );
}
pub const mCPUComponentType_CPU_COMPONENT_DEBUGGER: mCPUComponentType = 0;
pub const mCPUComponentType_CPU_COMPONENT_CHEAT_DEVICE: mCPUComponentType = 1;
pub const mCPUComponentType_CPU_COMPONENT_MISC_1: mCPUComponentType = 2;
pub const mCPUComponentType_CPU_COMPONENT_MISC_2: mCPUComponentType = 3;
pub const mCPUComponentType_CPU_COMPONENT_MISC_3: mCPUComponentType = 4;
pub const mCPUComponentType_CPU_COMPONENT_MISC_4: mCPUComponentType = 5;
pub const mCPUComponentType_CPU_COMPONENT_MAX: mCPUComponentType = 6;
pub type mCPUComponentType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mCPUComponent {
    pub id: u32,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(cpu: *mut ::std::os::raw::c_void, component: *mut mCPUComponent),
    >,
    pub deinit: ::std::option::Option<unsafe extern "C" fn(component: *mut mCPUComponent)>,
}
#[test]
fn bindgen_test_layout_mCPUComponent() {
    const UNINIT: ::std::mem::MaybeUninit<mCPUComponent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mCPUComponent>(),
        24usize,
        concat!("Size of: ", stringify!(mCPUComponent))
    );
    assert_eq!(
        ::std::mem::align_of::<mCPUComponent>(),
        8usize,
        concat!("Alignment of ", stringify!(mCPUComponent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mCPUComponent),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mCPUComponent),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinit) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mCPUComponent),
            "::",
            stringify!(deinit)
        )
    );
}
pub const mLogLevel_mLOG_FATAL: mLogLevel = 1;
pub const mLogLevel_mLOG_ERROR: mLogLevel = 2;
pub const mLogLevel_mLOG_WARN: mLogLevel = 4;
pub const mLogLevel_mLOG_INFO: mLogLevel = 8;
pub const mLogLevel_mLOG_DEBUG: mLogLevel = 16;
pub const mLogLevel_mLOG_STUB: mLogLevel = 32;
pub const mLogLevel_mLOG_GAME_ERROR: mLogLevel = 64;
pub const mLogLevel_mLOG_ALL: mLogLevel = 127;
pub type mLogLevel = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mLogFilter {
    pub defaultLevels: ::std::os::raw::c_int,
    pub categories: Table,
    pub levels: Table,
}
#[test]
fn bindgen_test_layout_mLogFilter() {
    const UNINIT: ::std::mem::MaybeUninit<mLogFilter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mLogFilter>(),
        152usize,
        concat!("Size of: ", stringify!(mLogFilter))
    );
    assert_eq!(
        ::std::mem::align_of::<mLogFilter>(),
        8usize,
        concat!("Alignment of ", stringify!(mLogFilter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultLevels) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mLogFilter),
            "::",
            stringify!(defaultLevels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).categories) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mLogFilter),
            "::",
            stringify!(categories)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).levels) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mLogFilter),
            "::",
            stringify!(levels)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mLogger {
    pub log: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mLogger,
            category: ::std::os::raw::c_int,
            level: mLogLevel,
            format: *const ::std::os::raw::c_char,
            args: *mut __va_list_tag,
        ),
    >,
    pub filter: *mut mLogFilter,
}
#[test]
fn bindgen_test_layout_mLogger() {
    const UNINIT: ::std::mem::MaybeUninit<mLogger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mLogger>(),
        16usize,
        concat!("Size of: ", stringify!(mLogger))
    );
    assert_eq!(
        ::std::mem::align_of::<mLogger>(),
        8usize,
        concat!("Alignment of ", stringify!(mLogger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mLogger),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mLogger),
            "::",
            stringify!(filter)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStandardLogger {
    pub d: mLogger,
    pub logToStdout: bool,
    pub logFile: *mut VFile,
}
#[test]
fn bindgen_test_layout_mStandardLogger() {
    const UNINIT: ::std::mem::MaybeUninit<mStandardLogger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mStandardLogger>(),
        32usize,
        concat!("Size of: ", stringify!(mStandardLogger))
    );
    assert_eq!(
        ::std::mem::align_of::<mStandardLogger>(),
        8usize,
        concat!("Alignment of ", stringify!(mStandardLogger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mStandardLogger),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logToStdout) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mStandardLogger),
            "::",
            stringify!(logToStdout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logFile) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mStandardLogger),
            "::",
            stringify!(logFile)
        )
    );
}
extern "C" {
    pub static mut _mLOG_CAT_STATUS: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut _mLOG_CAT_DEBUGGER: ::std::os::raw::c_int;
}
extern "C" {
    pub static DEBUGGER_ID: u32;
}
pub type mDebuggerAccessLogFlags = u8;
pub type mDebuggerAccessLogFlagsEx = u16;
pub const mDebuggerType_DEBUGGER_NONE: mDebuggerType = 0;
pub const mDebuggerType_DEBUGGER_CUSTOM: mDebuggerType = 1;
pub const mDebuggerType_DEBUGGER_CLI: mDebuggerType = 2;
pub const mDebuggerType_DEBUGGER_GDB: mDebuggerType = 3;
pub const mDebuggerType_DEBUGGER_ACCESS_LOGGER: mDebuggerType = 4;
pub const mDebuggerType_DEBUGGER_MAX: mDebuggerType = 5;
pub type mDebuggerType = ::std::os::raw::c_uint;
pub const mDebuggerState_DEBUGGER_CREATED: mDebuggerState = 0;
pub const mDebuggerState_DEBUGGER_PAUSED: mDebuggerState = 1;
pub const mDebuggerState_DEBUGGER_RUNNING: mDebuggerState = 2;
pub const mDebuggerState_DEBUGGER_CALLBACK: mDebuggerState = 3;
pub const mDebuggerState_DEBUGGER_SHUTDOWN: mDebuggerState = 4;
pub type mDebuggerState = ::std::os::raw::c_uint;
pub const mWatchpointType_WATCHPOINT_WRITE: mWatchpointType = 1;
pub const mWatchpointType_WATCHPOINT_READ: mWatchpointType = 2;
pub const mWatchpointType_WATCHPOINT_RW: mWatchpointType = 3;
pub const mWatchpointType_WATCHPOINT_CHANGE: mWatchpointType = 4;
pub const mWatchpointType_WATCHPOINT_WRITE_CHANGE: mWatchpointType = 5;
pub type mWatchpointType = ::std::os::raw::c_uint;
pub const mBreakpointType_BREAKPOINT_HARDWARE: mBreakpointType = 0;
pub const mBreakpointType_BREAKPOINT_SOFTWARE: mBreakpointType = 1;
pub type mBreakpointType = ::std::os::raw::c_uint;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_MANUAL: mDebuggerEntryReason = 0;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_ATTACHED: mDebuggerEntryReason = 1;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_BREAKPOINT: mDebuggerEntryReason = 2;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_WATCHPOINT: mDebuggerEntryReason = 3;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_ILLEGAL_OP: mDebuggerEntryReason = 4;
pub const mDebuggerEntryReason_DEBUGGER_ENTER_STACK: mDebuggerEntryReason = 5;
pub type mDebuggerEntryReason = ::std::os::raw::c_uint;
pub const mStackTraceMode_STACK_TRACE_DISABLED: mStackTraceMode = 0;
pub const mStackTraceMode_STACK_TRACE_ENABLED: mStackTraceMode = 1;
pub const mStackTraceMode_STACK_TRACE_BREAK_ON_RETURN: mStackTraceMode = 2;
pub const mStackTraceMode_STACK_TRACE_BREAK_ON_CALL: mStackTraceMode = 4;
pub const mStackTraceMode_STACK_TRACE_BREAK_ON_BOTH: mStackTraceMode = 6;
pub type mStackTraceMode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mDebuggerEntryInfo {
    pub address: u32,
    pub segment: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub type_: mDebuggerEntryInfo__bindgen_ty_1,
    pub pointId: isize,
    pub target: *mut mDebuggerModule,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mDebuggerEntryInfo__bindgen_ty_1 {
    pub wp: mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1,
    pub bp: mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2,
    pub st: mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1 {
    pub oldValue: u32,
    pub newValue: u32,
    pub watchType: mWatchpointType,
    pub accessType: mWatchpointType,
}
#[test]
fn bindgen_test_layout_mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oldValue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(oldValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newValue) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(newValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).watchType) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(watchType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessType) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(accessType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2 {
    pub opcode: u32,
    pub breakType: mBreakpointType,
}
#[test]
fn bindgen_test_layout_mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opcode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).breakType) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(breakType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3 {
    pub traceType: mStackTraceMode,
}
#[test]
fn bindgen_test_layout_mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).traceType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(traceType)
        )
    );
}
#[test]
fn bindgen_test_layout_mDebuggerEntryInfo__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerEntryInfo__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerEntryInfo__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(mDebuggerEntryInfo__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerEntryInfo__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1),
            "::",
            stringify!(wp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1),
            "::",
            stringify!(bp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo__bindgen_ty_1),
            "::",
            stringify!(st)
        )
    );
}
#[test]
fn bindgen_test_layout_mDebuggerEntryInfo() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerEntryInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerEntryInfo>(),
        48usize,
        concat!("Size of: ", stringify!(mDebuggerEntryInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerEntryInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(mDebuggerEntryInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(segment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointId) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(pointId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerEntryInfo),
            "::",
            stringify!(target)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mBreakpoint {
    pub id: isize,
    pub address: u32,
    pub segment: ::std::os::raw::c_int,
    pub type_: mBreakpointType,
    pub condition: *mut ParseTree,
}
#[test]
fn bindgen_test_layout_mBreakpoint() {
    const UNINIT: ::std::mem::MaybeUninit<mBreakpoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mBreakpoint>(),
        32usize,
        concat!("Size of: ", stringify!(mBreakpoint))
    );
    assert_eq!(
        ::std::mem::align_of::<mBreakpoint>(),
        8usize,
        concat!("Alignment of ", stringify!(mBreakpoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpoint),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpoint),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpoint),
            "::",
            stringify!(segment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpoint),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).condition) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpoint),
            "::",
            stringify!(condition)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mWatchpoint {
    pub id: isize,
    pub segment: ::std::os::raw::c_int,
    pub minAddress: u32,
    pub maxAddress: u32,
    pub type_: mWatchpointType,
    pub condition: *mut ParseTree,
}
#[test]
fn bindgen_test_layout_mWatchpoint() {
    const UNINIT: ::std::mem::MaybeUninit<mWatchpoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mWatchpoint>(),
        32usize,
        concat!("Size of: ", stringify!(mWatchpoint))
    );
    assert_eq!(
        ::std::mem::align_of::<mWatchpoint>(),
        8usize,
        concat!("Alignment of ", stringify!(mWatchpoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(segment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minAddress) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(minAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxAddress) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(maxAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).condition) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpoint),
            "::",
            stringify!(condition)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerInstructionInfo {
    pub address: u32,
    pub segment: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_uint,
    pub flags: [mDebuggerAccessLogFlags; 4usize],
    pub flagsEx: [mDebuggerAccessLogFlagsEx; 4usize],
}
#[test]
fn bindgen_test_layout_mDebuggerInstructionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerInstructionInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerInstructionInfo>(),
        24usize,
        concat!("Size of: ", stringify!(mDebuggerInstructionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerInstructionInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(mDebuggerInstructionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerInstructionInfo),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segment) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerInstructionInfo),
            "::",
            stringify!(segment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerInstructionInfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerInstructionInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flagsEx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerInstructionInfo),
            "::",
            stringify!(flagsEx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mBreakpointList {
    pub vector: *mut mBreakpoint,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_mBreakpointList() {
    const UNINIT: ::std::mem::MaybeUninit<mBreakpointList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mBreakpointList>(),
        24usize,
        concat!("Size of: ", stringify!(mBreakpointList))
    );
    assert_eq!(
        ::std::mem::align_of::<mBreakpointList>(),
        8usize,
        concat!("Alignment of ", stringify!(mBreakpointList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpointList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpointList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mBreakpointList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mWatchpointList {
    pub vector: *mut mWatchpoint,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_mWatchpointList() {
    const UNINIT: ::std::mem::MaybeUninit<mWatchpointList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mWatchpointList>(),
        24usize,
        concat!("Size of: ", stringify!(mWatchpointList))
    );
    assert_eq!(
        ::std::mem::align_of::<mWatchpointList>(),
        8usize,
        concat!("Alignment of ", stringify!(mWatchpointList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpointList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpointList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mWatchpointList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerModuleList {
    pub vector: *mut *mut mDebuggerModule,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_mDebuggerModuleList() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerModuleList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerModuleList>(),
        24usize,
        concat!("Size of: ", stringify!(mDebuggerModuleList))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerModuleList>(),
        8usize,
        concat!("Alignment of ", stringify!(mDebuggerModuleList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModuleList),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModuleList),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModuleList),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStackFrame {
    pub callSegment: ::std::os::raw::c_int,
    pub callAddress: u32,
    pub entrySegment: ::std::os::raw::c_int,
    pub entryAddress: u32,
    pub frameBaseSegment: ::std::os::raw::c_int,
    pub frameBaseAddress: u32,
    pub regs: *mut ::std::os::raw::c_void,
    pub finished: bool,
    pub breakWhenFinished: bool,
    pub interrupt: bool,
}
#[test]
fn bindgen_test_layout_mStackFrame() {
    const UNINIT: ::std::mem::MaybeUninit<mStackFrame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mStackFrame>(),
        40usize,
        concat!("Size of: ", stringify!(mStackFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<mStackFrame>(),
        8usize,
        concat!("Alignment of ", stringify!(mStackFrame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callSegment) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(callSegment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callAddress) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(callAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entrySegment) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(entrySegment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entryAddress) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(entryAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameBaseSegment) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(frameBaseSegment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameBaseAddress) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(frameBaseAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(regs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).finished) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(finished)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).breakWhenFinished) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(breakWhenFinished)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interrupt) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrame),
            "::",
            stringify!(interrupt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStackFrames {
    pub vector: *mut mStackFrame,
    pub size: usize,
    pub capacity: usize,
}
#[test]
fn bindgen_test_layout_mStackFrames() {
    const UNINIT: ::std::mem::MaybeUninit<mStackFrames> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mStackFrames>(),
        24usize,
        concat!("Size of: ", stringify!(mStackFrames))
    );
    assert_eq!(
        ::std::mem::align_of::<mStackFrames>(),
        8usize,
        concat!("Alignment of ", stringify!(mStackFrames))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrames),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrames),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackFrames),
            "::",
            stringify!(capacity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mStackTrace {
    pub stack: mStackFrames,
    pub registersSize: usize,
    pub formatRegisters: ::std::option::Option<
        unsafe extern "C" fn(
            frame: *mut mStackFrame,
            out: *mut ::std::os::raw::c_char,
            length: *mut usize,
        ),
    >,
}
#[test]
fn bindgen_test_layout_mStackTrace() {
    const UNINIT: ::std::mem::MaybeUninit<mStackTrace> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mStackTrace>(),
        40usize,
        concat!("Size of: ", stringify!(mStackTrace))
    );
    assert_eq!(
        ::std::mem::align_of::<mStackTrace>(),
        8usize,
        concat!("Alignment of ", stringify!(mStackTrace))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackTrace),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registersSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackTrace),
            "::",
            stringify!(registersSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatRegisters) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mStackTrace),
            "::",
            stringify!(formatRegisters)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ParseTree {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerPlatform {
    pub p: *mut mDebugger,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(cpu: *mut ::std::os::raw::c_void, arg1: *mut mDebuggerPlatform),
    >,
    pub deinit: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerPlatform)>,
    pub entered: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            arg2: mDebuggerEntryReason,
            arg3: *mut mDebuggerEntryInfo,
        ),
    >,
    pub hasBreakpoints:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerPlatform) -> bool>,
    pub checkBreakpoints: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerPlatform)>,
    pub clearBreakpoint: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mDebuggerPlatform, id: isize) -> bool,
    >,
    pub setBreakpoint: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            arg2: *mut mDebuggerModule,
            arg3: *const mBreakpoint,
        ) -> isize,
    >,
    pub listBreakpoints: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            arg2: *mut mDebuggerModule,
            arg3: *mut mBreakpointList,
        ),
    >,
    pub setWatchpoint: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            arg2: *mut mDebuggerModule,
            arg3: *const mWatchpoint,
        ) -> isize,
    >,
    pub listWatchpoints: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            arg2: *mut mDebuggerModule,
            arg3: *mut mWatchpointList,
        ),
    >,
    pub trace: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            out: *mut ::std::os::raw::c_char,
            length: *mut usize,
        ),
    >,
    pub lookupIdentifier: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerPlatform,
            name: *const ::std::os::raw::c_char,
            value: *mut i32,
            segment: *mut ::std::os::raw::c_int,
        ) -> bool,
    >,
    pub getStackTraceMode: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mDebuggerPlatform) -> mStackTraceMode,
    >,
    pub setStackTraceMode: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut mDebuggerPlatform, mode: mStackTraceMode),
    >,
    pub updateStackTrace:
        ::std::option::Option<unsafe extern "C" fn(d: *mut mDebuggerPlatform) -> bool>,
    pub nextInstructionInfo: ::std::option::Option<
        unsafe extern "C" fn(d: *mut mDebuggerPlatform, info: *mut mDebuggerInstructionInfo),
    >,
}
#[test]
fn bindgen_test_layout_mDebuggerPlatform() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerPlatform> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerPlatform>(),
        136usize,
        concat!("Size of: ", stringify!(mDebuggerPlatform))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerPlatform>(),
        8usize,
        concat!("Alignment of ", stringify!(mDebuggerPlatform))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinit) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(deinit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entered) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(entered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasBreakpoints) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(hasBreakpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checkBreakpoints) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(checkBreakpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clearBreakpoint) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(clearBreakpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setBreakpoint) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(setBreakpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listBreakpoints) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(listBreakpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setWatchpoint) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(setWatchpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).listWatchpoints) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(listWatchpoints)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trace) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(trace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lookupIdentifier) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(lookupIdentifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getStackTraceMode) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(getStackTraceMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setStackTraceMode) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(setStackTraceMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).updateStackTrace) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(updateStackTrace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextInstructionInfo) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerPlatform),
            "::",
            stringify!(nextInstructionInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebugger {
    pub d: mCPUComponent,
    pub platform: *mut mDebuggerPlatform,
    pub state: mDebuggerState,
    pub core: *mut mCore,
    pub bridge: *mut mScriptBridge,
    pub stackTrace: mStackTrace,
    pub modules: mDebuggerModuleList,
    pub pointOwner: Table,
}
#[test]
fn bindgen_test_layout_mDebugger() {
    const UNINIT: ::std::mem::MaybeUninit<mDebugger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebugger>(),
        192usize,
        concat!("Size of: ", stringify!(mDebugger))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebugger>(),
        8usize,
        concat!("Alignment of ", stringify!(mDebugger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).platform) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(platform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(core)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bridge) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(bridge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stackTrace) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(stackTrace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modules) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(modules)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointOwner) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebugger),
            "::",
            stringify!(pointOwner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mDebuggerModule {
    pub p: *mut mDebugger,
    pub type_: mDebuggerType,
    pub isPaused: bool,
    pub needsCallback: bool,
    pub init: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule)>,
    pub deinit: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule)>,
    pub paused:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule, timeoutMs: i32)>,
    pub update: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule)>,
    pub entered: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut mDebuggerModule,
            arg2: mDebuggerEntryReason,
            arg3: *mut mDebuggerEntryInfo,
        ),
    >,
    pub custom: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule)>,
    pub interrupt: ::std::option::Option<unsafe extern "C" fn(arg1: *mut mDebuggerModule)>,
}
#[test]
fn bindgen_test_layout_mDebuggerModule() {
    const UNINIT: ::std::mem::MaybeUninit<mDebuggerModule> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mDebuggerModule>(),
        72usize,
        concat!("Size of: ", stringify!(mDebuggerModule))
    );
    assert_eq!(
        ::std::mem::align_of::<mDebuggerModule>(),
        8usize,
        concat!("Alignment of ", stringify!(mDebuggerModule))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isPaused) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(isPaused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).needsCallback) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(needsCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deinit) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(deinit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paused) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(paused)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entered) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(entered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(custom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interrupt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(mDebuggerModule),
            "::",
            stringify!(interrupt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mArguments {
    pub fname: *mut ::std::os::raw::c_char,
    pub patch: *mut ::std::os::raw::c_char,
    pub cheatsFile: *mut ::std::os::raw::c_char,
    pub savestate: *mut ::std::os::raw::c_char,
    pub bios: *mut ::std::os::raw::c_char,
    pub logLevel: ::std::os::raw::c_int,
    pub frameskip: ::std::os::raw::c_int,
    pub configOverrides: Table,
    pub debugAtStart: bool,
    pub debugCli: bool,
    pub debugGdb: bool,
    pub showHelp: bool,
    pub showVersion: bool,
}
#[test]
fn bindgen_test_layout_mArguments() {
    const UNINIT: ::std::mem::MaybeUninit<mArguments> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mArguments>(),
        128usize,
        concat!("Size of: ", stringify!(mArguments))
    );
    assert_eq!(
        ::std::mem::align_of::<mArguments>(),
        8usize,
        concat!("Alignment of ", stringify!(mArguments))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(fname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).patch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cheatsFile) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(cheatsFile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).savestate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(savestate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bios) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(bios)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logLevel) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(logLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frameskip) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(frameskip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).configOverrides) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(configOverrides)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debugAtStart) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(debugAtStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debugCli) as usize - ptr as usize },
        121usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(debugCli)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).debugGdb) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(debugGdb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).showHelp) as usize - ptr as usize },
        123usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(showHelp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).showVersion) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(mArguments),
            "::",
            stringify!(showVersion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mOption {
    pub name: *const ::std::os::raw::c_char,
    pub arg: bool,
    pub shortEquiv: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_mOption() {
    const UNINIT: ::std::mem::MaybeUninit<mOption> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mOption>(),
        16usize,
        concat!("Size of: ", stringify!(mOption))
    );
    assert_eq!(
        ::std::mem::align_of::<mOption>(),
        8usize,
        concat!("Alignment of ", stringify!(mOption))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mOption),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mOption),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shortEquiv) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(mOption),
            "::",
            stringify!(shortEquiv)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mSubParser {
    pub usage: *const ::std::os::raw::c_char,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            parser: *mut mSubParser,
            option: ::std::os::raw::c_int,
            arg: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub parseLong: ::std::option::Option<
        unsafe extern "C" fn(
            parser: *mut mSubParser,
            option: *const ::std::os::raw::c_char,
            arg: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub apply: ::std::option::Option<
        unsafe extern "C" fn(parser: *mut mSubParser, config: *mut mCoreConfig),
    >,
    pub extraOptions: *const ::std::os::raw::c_char,
    pub longOptions: *const mOption,
    pub opts: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_mSubParser() {
    const UNINIT: ::std::mem::MaybeUninit<mSubParser> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mSubParser>(),
        56usize,
        concat!("Size of: ", stringify!(mSubParser))
    );
    assert_eq!(
        ::std::mem::align_of::<mSubParser>(),
        8usize,
        concat!("Alignment of ", stringify!(mSubParser))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parse) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parseLong) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(parseLong)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).apply) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(apply)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extraOptions) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(extraOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longOptions) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(longOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opts) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mSubParser),
            "::",
            stringify!(opts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mGraphicsOpts {
    pub multiplier: ::std::os::raw::c_int,
    pub fullscreen: bool,
}
#[test]
fn bindgen_test_layout_mGraphicsOpts() {
    const UNINIT: ::std::mem::MaybeUninit<mGraphicsOpts> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mGraphicsOpts>(),
        8usize,
        concat!("Size of: ", stringify!(mGraphicsOpts))
    );
    assert_eq!(
        ::std::mem::align_of::<mGraphicsOpts>(),
        4usize,
        concat!("Alignment of ", stringify!(mGraphicsOpts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multiplier) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mGraphicsOpts),
            "::",
            stringify!(multiplier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fullscreen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mGraphicsOpts),
            "::",
            stringify!(fullscreen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: _bindgen_ty_6 = 1;
pub const MSG_PEEK: _bindgen_ty_6 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_6 = 4;
pub const MSG_CTRUNC: _bindgen_ty_6 = 8;
pub const MSG_PROXY: _bindgen_ty_6 = 16;
pub const MSG_TRUNC: _bindgen_ty_6 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_6 = 64;
pub const MSG_EOR: _bindgen_ty_6 = 128;
pub const MSG_WAITALL: _bindgen_ty_6 = 256;
pub const MSG_FIN: _bindgen_ty_6 = 512;
pub const MSG_SYN: _bindgen_ty_6 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_6 = 2048;
pub const MSG_RST: _bindgen_ty_6 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_6 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_6 = 16384;
pub const MSG_MORE: _bindgen_ty_6 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_6 = 65536;
pub const MSG_BATCH: _bindgen_ty_6 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_6 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_6 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_6 = 1073741824;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cmsg_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
pub const SCM_RIGHTS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<osockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_8 = 0;
pub const SHUT_WR: _bindgen_ty_8 = 1;
pub const SHUT_RDWR: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    const UNINIT: ::std::mem::MaybeUninit<ip_opts> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_dst) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_opts) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_opts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreqn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_address) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_ifindex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_ifindex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_spec_dst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub const IPPROTO_IP: _bindgen_ty_9 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_9 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_9 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_9 = 4;
pub const IPPROTO_TCP: _bindgen_ty_9 = 6;
pub const IPPROTO_EGP: _bindgen_ty_9 = 8;
pub const IPPROTO_PUP: _bindgen_ty_9 = 12;
pub const IPPROTO_UDP: _bindgen_ty_9 = 17;
pub const IPPROTO_IDP: _bindgen_ty_9 = 22;
pub const IPPROTO_TP: _bindgen_ty_9 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_9 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_9 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_9 = 46;
pub const IPPROTO_GRE: _bindgen_ty_9 = 47;
pub const IPPROTO_ESP: _bindgen_ty_9 = 50;
pub const IPPROTO_AH: _bindgen_ty_9 = 51;
pub const IPPROTO_MTP: _bindgen_ty_9 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_9 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_9 = 98;
pub const IPPROTO_PIM: _bindgen_ty_9 = 103;
pub const IPPROTO_COMP: _bindgen_ty_9 = 108;
